extras/xfire/test/service/com/beathive/service/getUser.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <getUser xmlns="http://service.beathive.com">
    <in0>1</in0>
  </getUser>
 </env:Body>
</env:Envelope>
